# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Custom Model: YOLO26 Head + YOLO12 Backbone
# Combined configuration

# Parameters (YOLO26 specific parameters)
nc: 80 # number of classes
end2end: True # YOLO26 uses end-to-end mode
reg_max: 1 # DFL bins
text_model: mobileclip2:b

# Scales (Using YOLO12 scales for the backbone)
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12 Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8 (Output P3)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, A2C2f, [512, True, 4]] # 6-P4/16 (Output P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, A2C2f, [1024, True, 1]] # 8-P5/32 (Output P5)

# YOLO26 Head (Adapted for YOLO12 Backbone indices)
head:
  # Top-down path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]] # 10 cat backbone P4 (Index 6 from YOLO12)
  - [-1, 2, C3k2, [512, True]] # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]] # 13 cat backbone P3 (Index 4 from YOLO12)
  - [-1, 2, C3k2, [256, True]] # 14 (Output P3/8-small)

  # Bottom-up path
  - [-1, 1, Conv, [256, 3, 2]] # 15
  - [[-1, 11], 1, Concat, [1]] # 16 cat head P4
  - [-1, 2, C3k2, [512, True]] # 17 (Output P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 18
  - [[-1, 8], 1, Concat, [1]] # 19 cat head P5 (Index 8 from YOLO12)
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 20 (Output P5/32-large)

  # YOLO26 Segment Head
  - [[14, 17, 20], 1, YOLOESegment26, [nc, 32, 256, 512, True]] # Detect(P3, P4, P5)